xfire-sandbox/xfire-ws-security/src/test/META-INF/xfire/response.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
<xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference>
<ds:X509IssuerSerial xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:X509IssuerName xmlns:ds="http://www.w3.org/2000/09/xmldsig#">CN=alias</ds:X509IssuerName>

<ds:X509SerialNumber xmlns:ds="http://www.w3.org/2000/09/xmldsig#">1129395317</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</wsse:SecurityTokenReference>
</ds:KeyInfo>
<xenc:CipherData>
<xenc:CipherValue>A/0lblbOgKBTEa6c1A/uKyvHpQuA0IQPzQaInGLDQgo4PNtQWstUM3YcHoqXW34FI3pQzU8jLa/c
f9pDV7d7W7QyBzghXyJKIAELSi5pw8q53TPj/1rwUfbFEP3UIiv358T8XWyZAM+PRZ/ClCdNUL/g
LJlTPXNHUbNtDTXUEUc=</xenc:CipherValue>
</xenc:CipherData>
<xenc:ReferenceList>
<xenc:DataReference URI="#EncDataId-17711949"/>
</xenc:ReferenceList>
</xenc:EncryptedKey>
</wsse:Security>
</soapenv:Header>
	<soapenv:Body>
<xenc:EncryptedData Id="EncDataId-17711949" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"/>
<xenc:CipherData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
<xenc:CipherValue xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">Tc6mkZLahU9IAOjAbQQA18/taP4AFIW4zPF9SYq0ns+ZAFDQSajmyxoJGw4jjRCIAw6lS5HHkI76
ucfSznVuU521RJFeIBNePOaods8tbMt8DQmc1SF0dCZRWkBUiZ7GAnch3VsZeRXzKJeFBapUsHET
Q2kOJH8DtlEsM9jIKfARdP5VpcOxXhOlpBNzZjF5WEdzmv2TJjQ1aJZfp0PekSw+UygVe9DZO06I
GFoX55tTok9B2nGDXgUtEAS/mF8TqSVh38UpTphjqr32pO8piZmvp2PtzsbKiKh0Ls9x1ghCp2yc
fTzNDybQ4n7UNEkA+d7ih9O5qbYEUJOyOVaoKHfi2UtT3//OvspWhPLBaQnkLKwGcwh0MR6YsqNY
Wmi6</xenc:CipherValue>
</xenc:CipherData>
</xenc:EncryptedData>
</soapenv:Body>
</soapenv:Envelope>
